/**
  ******************************************************************************
  * @file    usb_endp.c
  * @brief   端点回调(基于 ST JoyStickMouse V3.4.0)
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "hw_config.h"
#include "usb_lib.h"
#include "usb_istr.h"

/*******************************************************************************
* Function Name  : EP1_IN_Callback
* Description    : EP1 IN 传输完成 -> 允许发送下一帧
*******************************************************************************/
void EP1_IN_Callback(void)
{
  PrevXferComplete = 1;
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
